"""
案例：
    演示张量的基本运算

涉及到的函数：
    add(), sub(), mul(), div(), neg()        -> 加减乘除
    add_(), sub_(), mul_(), div_(), neg_()_        -> 加减乘除,只不过可以修改源数据，类似于pandas部分的inplace = True

需要掌握的函数：
        1.可以是用+ - * /符号代替上述的加减乘除运算
        2.如果张量和数值运算，则：该数值会和张量中每个值进行运算
"""

# 导包
import torch

# 1.创建张量
t1 = torch.tensor([1, 2, 3])

# 2.演示加法
# t2 = t1.add(10)  # t1中的每个值都会加10,不会修改原数据
# t2 = t1 + 10     # 效果同上

# t1.add_(10)      # 会修改原数据
# t1 += 10         #效果同上


# 其他函数效果同上，这里快速的演示
# t2 = t1.sub(1)   # 减法
# t2 = t1.mul(2)   # 乘法
# t2 = t1.div(2)   # 除法
# t2 = t1.neg()  # 取反

t2 = t1 // 2

# 3.打印结果
print(f't1:{t1}')
print(f't2:{t2}')
