"""
案例：
    演示张量的索引操作

分类：
    简单的行列索引
    列表索引
    范围索引
    布尔索引
    多维索引

掌握：
    简单行列索引、范围索引、多维索引
"""

# 导包
import torch

# 1.设置随机种子
torch.manual_seed(24)

# 2.创建随机张量
t1 = torch.randint(1, 10, (5, 5))
print(f't1 = {t1}')
print('-' * 30)

# 3.演示张量的索引操作
# 场景1:简单的行列索引  格式：张量对象[行,列]
# 需求1：获取第2行的数据
print(t1[1])
print(t1[1, :])  # 效果同上，这里：表示所有列，第2行所有列

# 需求2：表示所有行的第三列数据
print(t1[:, 2])
print('-' * 30)

# 场景2:列表索引
# 需求1：返回(0,1),(1,2)两个位置的元素
print(t1[[0, 1], [1, 2]])

# 需求2：返回(1，2),(3，4)两个位置的元素   (1,2)表示的是行，(3，4)表示的是列
print(t1[[1, 3], [2, 4]])  # 写程序的时候一定要注意：前面的行的个数必须和后面括号中列的个数相等

# 需求3：获取第0，1行的1，2列元素
print(t1[[[0], [1]], [1, 2]])  # [0]表示：将第0行所有和[1,2]整体进行匹配
print('-' * 30)

# 场景3:范围索引
# 需求1：前3行，前2列
print(t1[:3, :2])  # 注意：这个地方和切片一样，:3表示0-2，:2表示0-1  相当于是一个左闭右开区间

# 需求2：第2行到最后一行，前2列的数据
print(t1[1:, :2])

# 需求3：所有索引奇数行，所有所有偶数行
print(t1[1::2, ::2])
print('-' * 30)

# 场景4:布尔索引
# print(t1[torch.tensor([True,False,False,True,True]),:])   # 演示布尔写法

# 需求1：第3列大于5的 行 数据
print(t1[t1[:, 2] > 5])  # 为啥生成的不是9？是由于程序理解成了：先找到第三列中大于5的数据，然后输出了这个大于5这个数对应的整个行
# 故，这个地方无法生成第3列中大于5的数据，也就是无法单独完成9的生成

# 需求2：第2行大于5的 列 数据
# 理解1：在第2行基础之上，找到该行大于5的列索引，然后找所有行中对应的元素
print(t1[:, t1[1, :] > 5])
print(t1[:, t1[1] > 5])  # 效果同上

# 理解2：在第2行的基础之上，找到该行大于5的元素
print(t1[1, t1[1, :] > 5])
print('-' * 30)

# 场景5:多维索引
# 创建3为张量 创建2个3行4列的矩阵
t2 = torch.randint(1, 10, (2, 3, 4))
print(f't2 = {t2}')

# 需求1：获取0轴上的第1个元素
print(t2[0, :, :])

# 需求2：获取1轴上的第1个元素
print(t2[:, 0, :])

# 需求3：获取2轴上的第1个元素
print(t2[:, :, 0])

# 至于0轴1轴2轴是啥？见goodnote笔记
